Jwagener1/DSP/stm32f4_Practical_1/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f429i_discovery_lcd.h"
#include "complex.h"
#include "math.h"
#include "FFTGraph.h"
#include "SignalGraph.h"
#include <string.h>
#include <stdio.h>


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define Buff_len 260
#define FFT_len 256
#define Sig_buflen 248

//Display Offsets

//Signal Graph

#define Sig_Vertical_lower 37
#define Sig_Vertical_upper 219

#define Sig_Horizontal_lower 57
#define Sig_Horizontal_upper 305


//FFT Graph

#define FFT_Vertical_lower 37
#define FFT_Vertical_upper 219

#define FFT_Horizontal_lower 32
#define FFT_Horizontal_upper 307
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
 ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

SPI_HandleTypeDef hspi5;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;

SDRAM_HandleTypeDef hsdram1;

/* USER CODE BEGIN PV */

uint16_t dmaBuffer[Buff_len];
float FFT_Buffer[FFT_len];
Point P_S[Sig_buflen*2];
Point P_F[FFT_len];
char msg[10];

//FFT code variables
int indexN = 0;
int indexM = 0;
int twiddleIndex = 0;

float complex evenSum = 0;
float complex unevenSum = 0;

float fftInput[FFT_len];

float twiddlePhase[FFT_len];
float complex twiddleFactor[FFT_len];

float complex outputFFT[FFT_len];
float complex firstHalfXm[FFT_len/2];
float complex secondHalfXm[FFT_len/2];
float fftMagOutput[FFT_len];
float fftMagLogOutput[FFT_len];

int samplingFinished = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_SPI5_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CRC_Init();
  MX_DMA2D_Init();
  MX_FMC_Init();
  MX_I2C3_Init();
  MX_LTDC_Init();
  MX_SPI5_Init();
  MX_TIM1_Init();
  MX_USART1_UART_Init();
  MX_USB_HOST_Init();
  MX_TIM2_Init();
  BSP_LCD_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_Base_Start(&htim2);
  HAL_TIM_OC_Start(&htim2,TIM_CHANNEL_1);
  HAL_ADC_Start_DMA(&hadc1,(uint32_t *)dmaBuffer,Buff_len);




  BSP_LCD_DisplayOn();
  BSP_LCD_LayerDefaultInit(0,LCD_FRAME_BUFFER);
  BSP_LCD_LayerDefaultInit(1,LCD_FRAME_BUFFER);
  BSP_LCD_SelectLayer(0);
  BSP_LCD_Clear(LCD_COLOR_TRANSPARENT);
  BSP_LCD_SelectLayer(1);
  BSP_LCD_Clear(LCD_COLOR_TRANSPARENT);




  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  if ((samplingFinished = 1))
  {
	  samplingFinished = 0;
	  for (int i=0; i < 256; i++)
		  {
				FFT_Buffer[i] = (((float)dmaBuffer[i]/4096.0) - 0.5);
		  }
	  //FFT Calculation
	  for (int count = 0; count < FFT_len; count++){
	      	fftInput[count] = FFT_Buffer[count];
	      }

	      // Calculate twiddle Factors
	      for (int ii = 0; ii < FFT_len; ii++){
	      	twiddlePhase[ii] = -(2*M_PI*ii)/FFT_len;
	      	twiddleFactor[ii] = cos(twiddlePhase[ii]) + sin(twiddlePhase[ii])*I;
	      }

	      // Calculate even sums and uneven sums
	      // M counter loop
	      for (indexM = 0; indexM < FFT_len/2; indexM++){
	      	// Reset even and uneven sums
	      	evenSum = 0;
	      	unevenSum = 0;

	      	// N counter loop
	      	for (indexN = 0; indexN < FFT_len/2; indexN++){
	      		// Calculate twiddle factor index
	      		twiddleIndex = indexN*indexM;

	      		// Adjust for multiple revolutions of twiddle phasor
	      		if (twiddleIndex >= FFT_len/2){
	      			twiddleIndex = twiddleIndex % FFT_len/2;
	      		}

	      		// Calculate sums
	      		evenSum = evenSum + fftInput[2*indexN]*twiddleFactor[2*twiddleIndex];
	      		unevenSum = unevenSum + fftInput[2*indexN + 1]*twiddleFactor[2*twiddleIndex];
	      	}

	      	// Store output values
	      	firstHalfXm[indexM] = evenSum + twiddleFactor[indexM]*unevenSum;
	      	secondHalfXm[indexM] = evenSum - twiddleFactor[indexM]*unevenSum;
	      }

	  	// Store output values in single array
	  	for (int firstHalfIndex = 0; firstHalfIndex < FFT_len/2; firstHalfIndex++){
	  		outputFFT[firstHalfIndex] = firstHalfXm[firstHalfIndex];
	  	}
	  	for (int secondHalfIndex = 0; secondHalfIndex < FFT_len/2; secondHalfIndex++){
	  		outputFFT[secondHalfIndex + FFT_len/2] = secondHalfXm[secondHalfIndex];
	  	}

	  	// Calculate magnitude of output
	  	for (int fftIndex = 0; fftIndex < FFT_len; fftIndex++){
	  		fftMagOutput[fftIndex] = (cabsf(outputFFT[fftIndex])) ;
	  	}

	  	// Calculate magnitude of output in DB
	  	for (int logIndex = 0; logIndex < FFT_len; logIndex++){
	  		fftMagLogOutput[logIndex] = 20*log10((2.0/256.0)*(1.5)*fftMagOutput[logIndex]);
	  	}


	  if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)==1)
	  	  {
		  //Signal Graph
		  for (int i = 0; i < Sig_buflen; i++)
		  {
			  float p = (float)dmaBuffer[i] * (182.0/4096.0) + 37.0 ;
		  	  P_S[i].X = (int)p;
		  	  P_S[Sig_buflen*2 - i -1].X = (int)p;

